/************************************************************************
 *				电子科技大学嵌入式软件工程中心 版权所有
 * 	 Copyright (C) 2005-2013 ESEC UESTC. All Rights Reserved.
 ***********************************************************************/

/*
 * $Log: c66xx_arch,v $
 * Revision 1.0  2013/06/13 13:13:00
 * 创建文件
*/

/*
 * @file 	c66xx_arch.h
 * @brief
 *	<li>功能：C66XX体系相关的头文件。</li>
 * @author	Insswer
 * @date 	2013-06-13
 * <p>部门：
 */


#ifndef		_C66XX_ARCH_H
#define		_C66XX_ARCH_H


/**************************** 引用部分 *********************************/


/**************************** 声明部分 *********************************/


/**************************** 定义部分 *********************************/
#define IRQ_TINT				  64
#define TIMER_0					  0

#define OSEK_TIMER_SRC          (TIMER_0 + get_coreid())
#define OSEK_TIMER_IRQ          IRQ_TINT

#endif
