/************************************************************************
 *				电子科技大学嵌入式软件工程中心 版权所有
 * 	 Copyright (C) 2005-2013 ESEC UESTC. All Rights Reserved.
 ***********************************************************************/

/*
 * $Log: c66xx_init,v $
 * Revision 1.0  2013/06/13 13:13:00
 * 创建文件
*/

/*
 * @file 	c66xx_init.h
 * @brief
 *	<li>功能：c66xx的体系初始化函数的声明头文件。</li>
 * @author	Insswer
 * @date 	2013-06-13
 * <p>部门：
 */

#ifndef _C66XX_INIT_H
#define _C66XX_INIT_H


/**************************** 引用部分 *********************************/


/**************************** 声明部分 *********************************/

void BSP_ArchInit(void);

/**************************** 定义部分 *********************************/




#endif /* INIT_H_ */
